CSI API ETABS v1
cFrameObj.GetSection Method
 Retrieves the frame section property assigned to a frame object.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSection(
	string Name,
	ref string PropName,
	ref string SAuto
)
Function GetSection (
	Name As String,
	ByRef PropName As String,
	ByRef SAuto As String
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim PropName As String
Dim SAuto As String
Dim returnValue As Integer
returnValue = instance.GetSection(Name,
	PropName, SAuto)
int GetSection(
	String^ Name,
	String^% PropName,
	String^% SAuto
)
abstract GetSection :
        Name : string *
        PropName : string byref *
        SAuto : string byref -> int
Parameters
Name
Type: System.String
 The name of a defined frame object.
PropName
Type: System.String
 If no auto select list is assigned to the frame object, this is the name of the frame section property assigned to the frame object. If an auto select list is assigned to the frame object, this is the name of the frame section property, within the auto select list, which is currently being used as the analysis property for the frame object. If this item is None, no frame section property is assigned to the frame object.
SAuto
Type: System.String
 This is the name of the auto select list assigned to the frame object, if any. If this item is returned as a blank string, no auto select list is assigned to the frame object.
Return Value
Type: Int32
 Returns zero if the frame object property is successfully retrieved, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim PropName As String
   Dim SAuto As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'get frame section property
   ret = SapModel.FrameObj.GetSection("3", PropName, SAuto)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace